app/views/books/_form.html.erb

SELECT "genres".* FROM "genres"
---
  <%= form.label :genre_id %>
  <%= form.collection_select :genre_id, Genre.all, :id, :genre, {}, { class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" } %>