app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre_id", "cover_image", "rating", "detailed_description", "publish_date", "publisher", "isbn_number", "reviews_id", "submitted_by_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    @review.submitted_by = current_user
    # @book.cover_image.attach(params[:book][:cover_image]) if params[:book][:cover_image]

    respond_to do |format|
      if @book.save

UPDATE "books" SET "rating" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["rating", 3.0], ["updated_at", "2023-06-15 10:22:28.954057"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:id])
      @book.brief_description = @book.detailed_description.to_s.split("\n\n").first